# 거스름돈
# 춘향이는 편의점 카운터에서 일한다.

# 손님이 2원짜리와 5원짜리로만 거스름돈을 달라고 한다. 
# 2원짜리 동전과 5원짜리 동전은 무한정 많이 가지고 있다. 
# 동전의 개수가 최소가 되도록 거슬러 주어야 한다. 거스름돈이 n인 경우, 최소 동전의 개수가 몇 개인지 알려주는 프로그램을 작성하시오.

# 예를 들어, 거스름돈이 15원이면 5원짜리 3개를, 거스름돈이 14원이면 5원짜리 2개와 2원짜리 2개로 총 4개를, 
# 거스름돈이 13원이면 5원짜리 1개와 2원짜리 4개로 총 5개를 주어야 동전의 개수가 최소가 된다.

# 입력

# 1. 손님이 낸 돈을 입력 받고
num = int(input())

count = 0 # 동전 개수를 계산할 변수

while num > 0:
    # 5로 나눠서 떨어지는 몫 나누어 떨어지면 그냥 몫이 답이됨
    if num % 5 == 0:
        print(num //5 +count)
        break
    # 위에서 걸러지지 않을 경우 2 빼면서 동전이 추가된걸 카운트에 넣고
    # 5로 나누어 떨어질 때 까지 반복
    num -= 2
    count +=1
# 위에서 걸리지 않으면 -1 출력
if num < 0 :
    print(-1)

### 뭐가 틀린거지????
## 제출했는데 왜 안될까....